import nlp from '@/index';

describe('date util', () => {
  test('normal', () => {

    const test = [
      '五点一分',
      '十点十分',
      '八点十七分',
      '早上八点五十九分',
      '晚上八点五十九分',
      '九点二十分',
      '十一点五十九分五十九秒',
      '2019-5-3 19:00',
      '2019-05-3 19:00',
      '2019-5-03 19:00',
      '2019-05-03 19:00',
      '没有时间点',
      'Hi，all。下周一下午三点开会',
      '周一开会',
      '周五开会',
      '下下周一开会',
      '6:30 起床',
      '明天6:30 起床',
      '6-3 春游',
      '6月3日 春游',
      '12-1 春游',
      '明天早上跑步',
      '本周日到下周日出差',
      '周四下午三点到五点开会',
      '昨天上午，第八轮中美战略与经济对话气候变化问题特别联合会议召开',
    ].forEach(str => {
      console.log('%s: %s', str, nlp(str));
    })
  });
});